app/controllers/galleries_controller.rb

SELECT "galleries".* FROM "galleries"
---
  def index
    @galleries = Gallery.all

INSERT INTO "galleries" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "Test"], ["user_id", 1], ["created_at", "2025-07-25 19:39:26.450382"], ["updated_at", "2025-07-25 19:39:26.450382"]]
---
  def create
    @gallery = current_user.Gallery.new(gallery_params)

    respond_to do |format|
      if @gallery.save

SELECT "galleries".* FROM "galleries" WHERE "galleries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_gallery
      @gallery = Gallery.find(params[:id])