app/controllers/photos_controller.rb

SELECT "galleries".* FROM "galleries" WHERE "galleries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @gallery = Gallery.find(params[:gallery_id])

INSERT INTO "photos" ("caption", "gallery_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["caption", "downtown pittsbrugh"], ["gallery_id", 1], ["created_at", "2025-07-25 19:58:22.358343"], ["updated_at", "2025-07-25 19:58:22.358343"]]
---
  def create
    @photo = @gallery.photos.build(photo_params)

    respond_to do |format|
      if @photo.save

UPDATE "photos" SET "updated_at" = ? WHERE "photos"."id" = ?  [["updated_at", "2025-07-25 19:58:22.388960"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @photo.update(photo_params)

SELECT "galleries".* FROM "galleries" WHERE "galleries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_gallery
      @gallery = Gallery.find(params[:gallery_id])