app/views/galleries/show.html.erb

<h2>Photos:</h2>
<% @gallery.photos.each do |photo| %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."gallery_id" = ?  [["gallery_id", 1]]